SIMISA@@@@@@@@@@JINX0D0t______
 
Wagon ( #CCW_BR_B5_44851
 Type ( Engine )
 WagonShape ( CCW_BR_B5_44851.s )
 Size ( 2.686695m 3.890883m 12.34357m )
 CentreOfGravity ( 0m 1.945441m 0m )
 Centre ( 0m 0m 0m )
 Mass ( 72.2t )
 InertiaTensor ( Box ( 2.686695m 3.890883m 12.34357m ) )
 Coupling (
 Type ( Bar ) 
 Spring ( 
 Stiffness ( 1e6N/m 5e6N/m ) 
 Damping ( 1e6N/m/s 5e6N/m/s ) 
 Break ( 1e8N 1e8N ) 
 r0 ( 10cm 10cm ) 
 ) 
 CouplingHasRigidConnection ( 1 ) 
 Velocity ( 0.1m/s ) 
 ) 
 
 Coupling (
 Type ( Chain )
 Spring (
 Stiffness ( 1e6N/m 2e6N/m )
 Damping ( 1e6N/m/S 1e6N/m/S )
 Break ( 1e9N 1e9N )
 r0 ( 20cm 40cm )
 )
 )
 FreightAnim ( "..\\common.headcodes\\CCW_B5\\CCW_B5_HC_Class_E.s" 0 3.0 0.0 )
 Antislip ( 1 )
 Adheasion ( 0.3 0.6 2 0.5 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 240kN )
 DerailBufferForce ( 400kN )
 WheelRadius ( 0.463m )
 NumWheels ( 4 )
 Friction (
 50N/m/s 1 -1mph 0 1
 5.1N/rad/s 1 -1rad/s 0 1
 )
 
 BrakeEquipmentType( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
 BrakeSystemType( "Vacuum_single_pipe" )
 MaxBrakeForce( 120kN )
 
 MaxHandbrakeForce( 90kN )
 NumberOfHandbrakeLeverSteps ( 100 )
 
 MaxReleaseRate ( 10 )
 MaxApplicationRate ( 10 )
 MaxAuxilaryChargingRate ( 10 )
 BrakeCylinderPressureForMaxBrakeBrakeForce ( 21 )
 
 Sound ( "..\\..\\common.sound\\2cyl_generic\\#AI-2cyl-76-100-01.sms" )

 Lights ( 4

 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ff7200 )
 Position ( 0 2.2 -4.8 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( 0 2.1 -4.7 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.4 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ffe610 )
 Position ( 0 2.1 -4.7 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.4 )
 )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 TimeOfDay ( 2 )
 Unit ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 4
 State (
 Duration ( 0.02 )
 LightColour ( aaffa200 )
 Position ( -0.5 0.9 -4.1 )
 Azimuth ( -45 -90 -135 )
 Transition ( 0 )
 Radius ( 3 ) )
 State (
 Duration ( 0.01 )
 LightColour ( aaffae00 )
 Position (-0.5 0.9 -4.1)
 Azimuth ( -45 -90 -135 )
 Transition ( 0 )
 Radius ( 1 )
 )
 State (
 Duration ( 0.03 )
 LightColour ( aaffa900 )
 Position (-0.5 0.9 -4.1 )
 Azimuth ( -45 -90 -135 )
 Transition ( 0 )
 Radius ( 2 ) )
 State (
 Duration ( 0.01 )
 LightColour ( aaffa000 )
 Position (-0.5 0.9 -4.1 )
 Azimuth ( -45 -90 -135 )
 Transition ( 0 )
 Radius ( 4 ) )
 )
 )

 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 TimeOfDay ( 2 )
 Unit ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 4
 State (
 Duration ( 0.02 )
 LightColour ( aaffa200 )
 Position ( 0.5 0.9 -4.1 )
 Azimuth ( 45 90 135 )
 Transition ( 0 )
 Radius ( 3 ) )
 State (
 Duration ( 0.01 )
 LightColour ( aaffae00 )
 Position (0.5 0.9 -4.1)
 Azimuth ( 45 90 135 )
 Transition ( 0 )
 Radius ( 3 )
 )
 State (
 Duration ( 0.03 )
 LightColour ( aaffa900 )
 Position (0.5 0.9 -4.1 )
 Azimuth ( 45 90 135 )
 Transition ( 0 )
 Radius ( 2 ) )
 State (
 Duration ( 0.01 )
 LightColour ( aaffa000 )
 Position (0.5 0.9 -4.1 )
 Azimuth ( 45 90 135 )
 Transition ( 0 )
 Radius ( 4 ) )
 )
 )
 ) 
 )
 
 
Engine ( #CCW_BR_B5_44851
 Effects
 (
 SteamSpecialEffects
 (
comment
 (
 the format of these little blocks is as follow:

 offset.x offset.y offset.z
 normal.x normal.y normal.z
 width in metres

 defining the offset from the shape pivot point
 where steam / smoke should appear, the direction
 it should go and the width of the nozzle
 )

 WhistleFX
 (
 0.3 3.85 -3.6
 0 1 0
 0.05
 )

 SafetyValvesFX
 (
 0 3.885 -3.35
 0 1 0
 0.2
 )
 SafetyValvesFX
 (
 0 3.885 -3.25
 0 1 0
 0.2
 )

 StackFX
 (
 0 3.9 3.35
 0 1 0
 0.2
 )

 DrainpipeFX
 (
 -1.5 1.258 -3.6
 -0.4 -1 -0.2
 0.05
 )

 CylindersFX
 (
 -1.223 0.51 3.95
 0 0 1
 0.1
 )

 CylindersFX
 (
 1.223 0.51 3.95
 0 0 1
 0.1
 )


 )
 )
 
 Wagon ( #CCW_BR_B5_44851 )
 IsTenderRequired ( 1 )
 Type ( Steam )
 MaxPower ( 1500kW )
 MaxForce ( 26927lbf )
 MaxVelocity ( 100mph )
 WheelRadius ( 0.450m )
 Sanding ( 1e9mph )
 NumWheels ( 6 )
 BoilerLength ( 6.2m )
 BoilerVolume ( "160*(ft^3)" )
 BoilerEffectivity ( 1.26 )
 DraftingEffect ( 0.8 )
 BoilerResponsiveness ( 1.22 )
 CoalBurnage ( 3.6lb/hp/h )
 MaxBoilerOutput ( 32500lb/h )
 NumCylinders ( 2 )
 CylinderStroke ( 28in )
 CylinderDiameter ( 18.5in )
 CylinderVolume ( "12.8*(ft^3)" )
 CylinderEffectivity ( 1 )
 InjectorSizes ( 11mm 12mm )
 ExhaustLimit ( 36000lb/h )
 PrimingFactor ( 1 )
 BlastExponent ( 0.9 )
 MaxBoilerPressure ( 225psi )
 MaxFireMass ( 2500lb )
 IdealFireMass ( 1800lb )
 MaxWaterMass ( 4000lb )
 SafetyValvesSteamUsage ( 8000lb/h )
 ShovelCoalMass ( 1lb )
 SmokeCombustion ( 1 )
 MaxTenderCoalMass ( 18000lb )
 MaxTenderWaterMass ( 40000lb )
 InjectorTypes( 0 1 )
 SuperHeater ( 1.23 )
 SteamSmokeUnitsPerPoundOfFuel( 1 )
 SteamMaxSmokeUnitsReleaseRate( 10 )
 MaxSteamHeatingPressure( 80 )
 SafetyValvePressureDifference( 2 )
 SteamGaugeGlassHeight( 10 )
 
 BasicSteamUsage ( 1000lb/h )
 BasicCoalUsage ( 850lb/h )
 InjectorLimits1 ( 50psi 0.6 1 )
 InjectorLimits2 ( 60psi 0 1 )
 CylinderCocksPowerEfficiency ( 0.9 )
 SteamCylinderCocksOperation ( Manual )
 
 VacuumBrakesSmallEjectorPowerRating ( 3.5 )
 VacuumBrakesMinBoilerPressureMaxVacuum ( 110 )
 VacuumBrakesSmallEjectorUsageRate ( 500 )
 VacuumBrakesLargeEjectorUsageRate ( 2400 )
 VacuumBrakesHasVacuumPump ( 0 )
 
 TrainBrakesControllerMaxReleaseRate ( 12 )
 TrainBrakesControllerMinSystemPressure ( 0 )
 TrainBrakesControllerMaxSystemPressure ( 21 )
 
 EngineBrakesControllerHasProportionalBrake ( 1 )
 EngineBrakesProportionalBrakeLag ( 0.9 )
 
 BrakesEngineBrakeType( "Vacuum_single_pipe" )
 BrakesTrainBrakeType( "Vacuum_single_pipe" )
 BrakesEngineControllers( "Hand, Train" )
 
 SteamSmallestCutoff ( 8 )
 NumberOfDamperSteps ( 4 )
 
 RegulatorValveType ( Twin_port )
 RegulatorSecondValveStartPosition ( 0.5 )
 RegulatorPilotValveExponent ( 1.7 )
 RegulatorSecondValveExponent ( 1.7 )
 RegulatorPilotValveFullOpenning ( 0.3 )
 RegulatorMainValveInitialOpenning ( 0.4 )
 
 SteamBlowerEffectExponent ( 0.9 )
 SteamBlowerEfficiencyExponent ( 1.1 )
 SteamBlowerMaxSteamUsageRate( 500 ) 
 SteamBlowerMaxProportionOfBlastEffect ( 0.15 )
 
 SteamWaterScoopMinPickupSpeed( 25 ) 
 SteamWaterScoopMaxPickupSpeed( 60 ) 
 SteamWaterScoopResistance( 8500N )
 SteamWaterScoopMaxPickupRate ( 1000 )
 
 SteamSmokeUnitsPerPoundOfFuel ( 6.3 )

 
 

 EngineControllers (

 Regulator ( 0 1 0.025 0
 NumNotches ( 0 )
 )
 Cutoff ( -0.75 0.75 0.0075 0 
 NumNotches( 15
 Notch ( -0.75 0 Dummy )
 Notch ( -0.65 0 Dummy )
 Notch ( -0.55 0 Dummy )
 Notch ( -0.45 0 Dummy )
 Notch ( -0.35 0 Dummy )
 Notch ( -0.25 0 Dummy )
 Notch ( -0.15 0 Dummy )
 Notch ( 0.0 0 Dummy )
 Notch ( 0.15 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.35 0 Dummy )
 Notch ( 0.45 0 Dummy )
 Notch ( 0.55 0 Dummy )
 Notch ( 0.65 0 Dummy )
 Notch ( 0.75 0 Dummy )
 
 )
 )
 
 Brake_Train ( 0 1 0.0375 0.65
 NumNotches( 3
 Notch( 0 1 TrainBrakesControllerReleaseStart )
 Notch(0.01 1 TrainBrakesControllerRunningStart )
 Notch(0.2 1 TrainBrakesControllerApplyStart )
 )
 )
 Brake_Hand ( 0 1 0.0125 0
 NumNotches ( 0 )
 )
 FireDoor ( 0 1 0.1 0
 NumNotches ( 0 )
 )
 Sanding( 0 1 0 )
 Blower ( 0 1 0.025 0.2
 NumNotches ( 0 )
 )
 HeatingTap ( 0 1 0.025 0
 NumNotches ( 0 )
 )
 Shovel ( 0 1 0.1 0
 NumNotches ( 0 )
 )
 DampersFront ( 0 1 0.1 1
 NumNotches ( 0 )
 )
 DampersBack ( 0 1 0.1 0
 NumNotches ( 0 )
 )
 Injector1Steam ( 0 1 0 )
 Injector2Steam ( 0 1 0 )
 Injector1Water ( 0 1 0.1 0
 NumNotches ( 0 )
 )
 Injector2Water ( 0 1 0.1 0
 NumNotches ( 0 )
 )
 CylinderCocks ( 0 1 1 )
 Whistle ( 0 1 0 )
 WaterScoop ( 0 1 0 )
 SmallEjectorOrCompressor( 0 1 1 )
 Headlights( 0 1 0 )
 )
 
 EngineVariables( 775 1650 3000 230 0.5 35000 11200 350 1 1 )

 
 Name ( "#Derby Black 5 44851" )
 Description (
 "BR ex-LMS Black 5 44851. 44851 was allocated to Derby Shed 17A in 1948. 1952 saw 44851 transferred to Millhouses 19B. She was allocated back to Derby in 1959. She also went to Nottingham 16D, Burton 16F, and Trafford Park 9E.\n\n"
 )
 EngineOperatingProcedures (
 "The operating procedures for the engine.\n"+
 "\n"+
 "Currently this is exported only to Microsoft Train Simulator.\n"+
 " \n"
 )
)